arduino/ArduinoCore-sam/system/CMSIS/Device/ATMEL/sam4e/include/component/adc.h
/* -------- ADC_LCDR : (AFEC Offset: 0x20) Last Converted Data Register -------- */
#define ADC_LCDR_LDATA_Pos 0
#define ADC_LCDR_LDATA_Msk (0xffffu << ADC_LCDR_LDATA_Pos) /**< \brief (ADC_LCDR) Last Data Converted */
#define ADC_LCDR_CHNB_Pos 24
#define ADC_LCDR_CHNB_Msk (0xfu << ADC_LCDR_CHNB_Pos) /**< \brief (ADC_LCDR) Channel Number */
/* -------- ADC_IER : (AFEC Offset: 0x24) Interrupt Enable Register -------- */
#define ADC_IER_EOC0 (0x1u << 0) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 0 */
#define ADC_IER_EOC1 (0x1u << 1) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 1 */
#define ADC_IER_EOC2 (0x1u << 2) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 2 */
#define ADC_IER_EOC3 (0x1u << 3) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 3 */
#define ADC_IER_EOC4 (0x1u << 4) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 4 */
#define ADC_IER_EOC5 (0x1u << 5) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 5 */
#define ADC_IER_EOC6 (0x1u << 6) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 6 */
#define ADC_IER_EOC7 (0x1u << 7) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 7 */
#define ADC_IER_EOC8 (0x1u << 8) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 8 */
#define ADC_IER_EOC9 (0x1u << 9) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 9 */
#define ADC_IER_EOC10 (0x1u << 10) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 10 */
#define ADC_IER_EOC11 (0x1u << 11) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 11 */
#define ADC_IER_EOC12 (0x1u << 12) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 12 */
#define ADC_IER_EOC13 (0x1u << 13) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 13 */
#define ADC_IER_EOC14 (0x1u << 14) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 14 */
#define ADC_IER_EOC15 (0x1u << 15) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 15 */
#define ADC_IER_EOC16 (0x1u << 16) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 16 */
#define ADC_IER_EOC17 (0x1u << 17) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 17 */
#define ADC_IER_EOC18 (0x1u << 18) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 18 */
#define ADC_IER_EOC19 (0x1u << 19) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 19 */
#define ADC_IER_EOC20 (0x1u << 20) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 20 */
#define ADC_IER_EOC21 (0x1u << 21) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 21 */
#define ADC_IER_EOC22 (0x1u << 22) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 22 */
#define ADC_IER_EOC23 (0x1u << 23) /**< \brief (ADC_IER) End of Conversion Interrupt Enable 23 */
#define ADC_IER_DRDY (0x1u << 24) /**< \brief (ADC_IER) Data Ready Interrupt Enable */
#define ADC_IER_GOVRE (0x1u << 25) /**< \brief (ADC_IER) General Overrun Error Interrupt Enable */
#define ADC_IER_COMPE (0x1u << 26) /**< \brief (ADC_IER) Comparison Event Interrupt Enable+ */
#define ADC_IER_ENDRX (0x1u << 27) /**< \brief (ADC_IER) End of Receive Buffer Interrupt Enable */
#define ADC_IER_RXBUFF (0x1u << 28) /**< \brief (ADC_IER) Receive Buffer Full Interrupt Enable */
#define ADC_IER_TEMPCHG (0x1u << 30) /**< \brief (ADC_IER) Temperature Change Interrupt Enable */
#define ADC_IER_EOCAL (0x1u << 31) /**< \brief (ADC_IER) End of Calibration Sequence Interrupt Enable */
/* -------- ADC_IDR : (AFEC Offset: 0x28) Interrupt Disable Register -------- */
#define ADC_IDR_EOC0 (0x1u << 0) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 0 */
#define ADC_IDR_EOC1 (0x1u << 1) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 1 */
#define ADC_IDR_EOC2 (0x1u << 2) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 2 */
#define ADC_IDR_EOC3 (0x1u << 3) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 3 */
#define ADC_IDR_EOC4 (0x1u << 4) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 4 */
#define ADC_IDR_EOC5 (0x1u << 5) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 5 */
#define ADC_IDR_EOC6 (0x1u << 6) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 6 */
#define ADC_IDR_EOC7 (0x1u << 7) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 7 */
#define ADC_IDR_EOC8 (0x1u << 8) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 8 */
#define ADC_IDR_EOC9 (0x1u << 9) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 9 */
#define ADC_IDR_EOC10 (0x1u << 10) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 10 */
#define ADC_IDR_EOC11 (0x1u << 11) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 11 */
#define ADC_IDR_EOC12 (0x1u << 12) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 12 */
#define ADC_IDR_EOC13 (0x1u << 13) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 13 */
#define ADC_IDR_EOC14 (0x1u << 14) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 14 */
#define ADC_IDR_EOC15 (0x1u << 15) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 15 */
#define ADC_IDR_EOC16 (0x1u << 16) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 16 */
#define ADC_IDR_EOC17 (0x1u << 17) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 17 */
#define ADC_IDR_EOC18 (0x1u << 18) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 18 */
#define ADC_IDR_EOC19 (0x1u << 19) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 19 */
#define ADC_IDR_EOC20 (0x1u << 20) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 20 */
#define ADC_IDR_EOC21 (0x1u << 21) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 21 */
#define ADC_IDR_EOC22 (0x1u << 22) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 22 */
#define ADC_IDR_EOC23 (0x1u << 23) /**< \brief (ADC_IDR) End of Conversion Interrupt Disable 23 */
#define ADC_IDR_DRDY (0x1u << 24) /**< \brief (ADC_IDR) Data Ready Interrupt Disable */
#define ADC_IDR_GOVRE (0x1u << 25) /**< \brief (ADC_IDR) General Overrun Error Interrupt Disable */
#define ADC_IDR_COMPE (0x1u << 26) /**< \brief (ADC_IDR) Comparison Event Interrupt Disable */
#define ADC_IDR_ENDRX (0x1u << 27) /**< \brief (ADC_IDR) End of Receive Buffer Interrupt Disable */
#define ADC_IDR_RXBUFF (0x1u << 28) /**< \brief (ADC_IDR) Receive Buffer Full Interrupt Disable */
#define ADC_IDR_TEMPCHG (0x1u << 30) /**< \brief (ADC_IDR) Temperature Change Interrupt Disable */
#define ADC_IDR_EOCAL (0x1u << 31) /**< \brief (ADC_IDR) End of Calibration Sequence Interrupt Disable */
/* -------- ADC_IMR : (AFEC Offset: 0x2C) Interrupt Mask Register -------- */
#define ADC_IMR_EOC0 (0x1u << 0) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 0 */
#define ADC_IMR_EOC1 (0x1u << 1) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 1 */
#define ADC_IMR_EOC2 (0x1u << 2) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 2 */
#define ADC_IMR_EOC3 (0x1u << 3) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 3 */
#define ADC_IMR_EOC4 (0x1u << 4) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 4 */
#define ADC_IMR_EOC5 (0x1u << 5) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 5 */
#define ADC_IMR_EOC6 (0x1u << 6) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 6 */
#define ADC_IMR_EOC7 (0x1u << 7) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 7 */
#define ADC_IMR_EOC8 (0x1u << 8) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 8 */
#define ADC_IMR_EOC9 (0x1u << 9) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 9 */
#define ADC_IMR_EOC10 (0x1u << 10) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 10 */
#define ADC_IMR_EOC11 (0x1u << 11) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 11 */
#define ADC_IMR_EOC12 (0x1u << 12) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 12 */
#define ADC_IMR_EOC13 (0x1u << 13) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 13 */
#define ADC_IMR_EOC14 (0x1u << 14) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 14 */
#define ADC_IMR_EOC15 (0x1u << 15) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 15 */
#define ADC_IMR_EOC16 (0x1u << 16) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 16 */
#define ADC_IMR_EOC17 (0x1u << 17) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 17 */
#define ADC_IMR_EOC18 (0x1u << 18) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 18 */
#define ADC_IMR_EOC19 (0x1u << 19) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 19 */
#define ADC_IMR_EOC20 (0x1u << 20) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 20 */
#define ADC_IMR_EOC21 (0x1u << 21) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 21 */
#define ADC_IMR_EOC22 (0x1u << 22) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 22 */
#define ADC_IMR_EOC23 (0x1u << 23) /**< \brief (ADC_IMR) End of Conversion Interrupt Mask 23 */
#define ADC_IMR_DRDY (0x1u << 24) /**< \brief (ADC_IMR) Data Ready Interrupt Mask */
#define ADC_IMR_GOVRE (0x1u << 25) /**< \brief (ADC_IMR) General Overrun Error Interrupt Mask */
#define ADC_IMR_COMPE (0x1u << 26) /**< \brief (ADC_IMR) Comparison Event Interrupt Mask */
#define ADC_IMR_ENDRX (0x1u << 27) /**< \brief (ADC_IMR) End of Receive Buffer Interrupt Mask */
#define ADC_IMR_RXBUFF (0x1u << 28) /**< \brief (ADC_IMR) Receive Buffer Full Interrupt Mask */
#define ADC_IMR_TEMPCHG (0x1u << 30) /**< \brief (ADC_IMR) Temperature Change Interrupt Mask */
#define ADC_IMR_EOCAL (0x1u << 31) /**< \brief (ADC_IMR) End of Calibration Sequence Interrupt Mask */
/* -------- ADC_ISR : (AFEC Offset: 0x30) Interrupt Status Register -------- */
#define ADC_ISR_EOC0 (0x1u << 0) /**< \brief (ADC_ISR) End of Conversion 0 */
#define ADC_ISR_EOC1 (0x1u << 1) /**< \brief (ADC_ISR) End of Conversion 1 */
#define ADC_ISR_EOC2 (0x1u << 2) /**< \brief (ADC_ISR) End of Conversion 2 */
#define ADC_ISR_EOC3 (0x1u << 3) /**< \brief (ADC_ISR) End of Conversion 3 */
#define ADC_ISR_EOC4 (0x1u << 4) /**< \brief (ADC_ISR) End of Conversion 4 */
#define ADC_ISR_EOC5 (0x1u << 5) /**< \brief (ADC_ISR) End of Conversion 5 */
#define ADC_ISR_EOC6 (0x1u << 6) /**< \brief (ADC_ISR) End of Conversion 6 */
#define ADC_ISR_EOC7 (0x1u << 7) /**< \brief (ADC_ISR) End of Conversion 7 */
#define ADC_ISR_EOC8 (0x1u << 8) /**< \brief (ADC_ISR) End of Conversion 8 */
#define ADC_ISR_EOC9 (0x1u << 9) /**< \brief (ADC_ISR) End of Conversion 9 */
#define ADC_ISR_EOC10 (0x1u << 10) /**< \brief (ADC_ISR) End of Conversion 10 */
#define ADC_ISR_EOC11 (0x1u << 11) /**< \brief (ADC_ISR) End of Conversion 11 */
#define ADC_ISR_EOC12 (0x1u << 12) /**< \brief (ADC_ISR) End of Conversion 12 */
#define ADC_ISR_EOC13 (0x1u << 13) /**< \brief (ADC_ISR) End of Conversion 13 */
#define ADC_ISR_EOC14 (0x1u << 14) /**< \brief (ADC_ISR) End of Conversion 14 */
#define ADC_ISR_EOC15 (0x1u << 15) /**< \brief (ADC_ISR) End of Conversion 15 */
#define ADC_ISR_EOC16 (0x1u << 16) /**< \brief (ADC_ISR) End of Conversion 16 */
#define ADC_ISR_EOC17 (0x1u << 17) /**< \brief (ADC_ISR) End of Conversion 17 */
#define ADC_ISR_EOC18 (0x1u << 18) /**< \brief (ADC_ISR) End of Conversion 18 */
#define ADC_ISR_EOC19 (0x1u << 19) /**< \brief (ADC_ISR) End of Conversion 19 */
#define ADC_ISR_EOC20 (0x1u << 20) /**< \brief (ADC_ISR) End of Conversion 20 */
#define ADC_ISR_EOC21 (0x1u << 21) /**< \brief (ADC_ISR) End of Conversion 21 */
#define ADC_ISR_EOC22 (0x1u << 22) /**< \brief (ADC_ISR) End of Conversion 22 */
#define ADC_ISR_EOC23 (0x1u << 23) /**< \brief (ADC_ISR) End of Conversion 23 */
#define ADC_ISR_DRDY (0x1u << 24) /**< \brief (ADC_ISR) Data Ready */
#define ADC_ISR_GOVRE (0x1u << 25) /**< \brief (ADC_ISR) General Overrun Error */
#define ADC_ISR_COMPE (0x1u << 26) /**< \brief (ADC_ISR) Comparison Error */
#define ADC_ISR_ENDRX (0x1u << 27) /**< \brief (ADC_ISR) End of RX Buffer */
#define ADC_ISR_RXBUFF (0x1u << 28) /**< \brief (ADC_ISR) RX Buffer Full */
#define ADC_ISR_TEMPCHG (0x1u << 30) /**< \brief (ADC_ISR) Temperature Change */
#define ADC_ISR_EOCAL (0x1u << 31) /**< \brief (ADC_ISR) End of Calibration Sequence */
/* -------- ADC_OVER : (AFEC Offset: 0x4C) Overrun Status Register -------- */
#define ADC_OVER_OVRE0 (0x1u << 0) /**< \brief (ADC_OVER) Overrun Error 0 */
#define ADC_OVER_OVRE1 (0x1u << 1) /**< \brief (ADC_OVER) Overrun Error 1 */
#define ADC_OVER_OVRE2 (0x1u << 2) /**< \brief (ADC_OVER) Overrun Error 2 */
#define ADC_OVER_OVRE3 (0x1u << 3) /**< \brief (ADC_OVER) Overrun Error 3 */
#define ADC_OVER_OVRE4 (0x1u << 4) /**< \brief (ADC_OVER) Overrun Error 4 */
#define ADC_OVER_OVRE5 (0x1u << 5) /**< \brief (ADC_OVER) Overrun Error 5 */
#define ADC_OVER_OVRE6 (0x1u << 6) /**< \brief (ADC_OVER) Overrun Error 6 */
#define ADC_OVER_OVRE7 (0x1u << 7) /**< \brief (ADC_OVER) Overrun Error 7 */
#define ADC_OVER_OVRE8 (0x1u << 8) /**< \brief (ADC_OVER) Overrun Error 8 */
#define ADC_OVER_OVRE9 (0x1u << 9) /**< \brief (ADC_OVER) Overrun Error 9 */
#define ADC_OVER_OVRE10 (0x1u << 10) /**< \brief (ADC_OVER) Overrun Error 10 */
#define ADC_OVER_OVRE11 (0x1u << 11) /**< \brief (ADC_OVER) Overrun Error 11 */
#define ADC_OVER_OVRE12 (0x1u << 12) /**< \brief (ADC_OVER) Overrun Error 12 */
#define ADC_OVER_OVRE13 (0x1u << 13) /**< \brief (ADC_OVER) Overrun Error 13 */
#define ADC_OVER_OVRE14 (0x1u << 14) /**< \brief (ADC_OVER) Overrun Error 14 */
#define ADC_OVER_OVRE15 (0x1u << 15) /**< \brief (ADC_OVER) Overrun Error 15 */
#define ADC_OVER_OVRE16_Pos 16
#define ADC_OVER_OVRE16_Msk (0x3u << ADC_OVER_OVRE16_Pos) /**< \brief (ADC_OVER) Overrun Error 16 */
#define ADC_OVER_OVRE17 (0x1u << 18) /**< \brief (ADC_OVER) Overrun Error 17 */
#define ADC_OVER_OVRE18 (0x1u << 19) /**< \brief (ADC_OVER) Overrun Error 18 */
#define ADC_OVER_OVRE19 (0x1u << 20) /**< \brief (ADC_OVER) Overrun Error 19 */
#define ADC_OVER_OVRE20 (0x1u << 21) /**< \brief (ADC_OVER) Overrun Error 20 */
#define ADC_OVER_OVRE21 (0x1u << 22) /**< \brief (ADC_OVER) Overrun Error 21 */
#define ADC_OVER_OVRE22 (0x1u << 23) /**< \brief (ADC_OVER) Overrun Error 22 */
/* -------- ADC_CWR : (AFEC Offset: 0x50) Compare Window Register -------- */
#define ADC_CWR_LOWTHRES_Pos 0
#define ADC_CWR_LOWTHRES_Msk (0xfffu << ADC_CWR_LOWTHRES_Pos) /**< \brief (ADC_CWR) Low Threshold */
#define ADC_CWR_LOWTHRES(value) ((ADC_CWR_LOWTHRES_Msk & ((value) << ADC_CWR_LOWTHRES_Pos)))
#define ADC_CWR_HIGHTHRES_Pos 16
#define ADC_CWR_HIGHTHRES_Msk (0xfffu << ADC_CWR_HIGHTHRES_Pos) /**< \brief (ADC_CWR) High Threshold */
#define ADC_CWR_HIGHTHRES(value) ((ADC_CWR_HIGHTHRES_Msk & ((value) << ADC_CWR_HIGHTHRES_Pos)))
/* -------- ADC_CGR : (AFEC Offset: 0x54) Channel Gain Register -------- */
#define ADC_CGR_GAIN0_Pos 0
#define ADC_CGR_GAIN0_Msk (0x3u << ADC_CGR_GAIN0_Pos) /**< \brief (ADC_CGR) Gain for channel 0 */
#define ADC_CGR_GAIN0(value) ((ADC_CGR_GAIN0_Msk & ((value) << ADC_CGR_GAIN0_Pos)))
#define ADC_CGR_GAIN1_Pos 2
#define ADC_CGR_GAIN1_Msk (0x3u << ADC_CGR_GAIN1_Pos) /**< \brief (ADC_CGR) Gain for channel 1 */
#define ADC_CGR_GAIN1(value) ((ADC_CGR_GAIN1_Msk & ((value) << ADC_CGR_GAIN1_Pos)))
#define ADC_CGR_GAIN2_Pos 4
#define ADC_CGR_GAIN2_Msk (0x3u << ADC_CGR_GAIN2_Pos) /**< \brief (ADC_CGR) Gain for channel 2 */
#define ADC_CGR_GAIN2(value) ((ADC_CGR_GAIN2_Msk & ((value) << ADC_CGR_GAIN2_Pos)))
#define ADC_CGR_GAIN3_Pos 6
#define ADC_CGR_GAIN3_Msk (0x3u << ADC_CGR_GAIN3_Pos) /**< \brief (ADC_CGR) Gain for channel 3 */
#define ADC_CGR_GAIN3(value) ((ADC_CGR_GAIN3_Msk & ((value) << ADC_CGR_GAIN3_Pos)))
#define ADC_CGR_GAIN4_Pos 8
#define ADC_CGR_GAIN4_Msk (0x3u << ADC_CGR_GAIN4_Pos) /**< \brief (ADC_CGR) Gain for channel 4 */
#define ADC_CGR_GAIN4(value) ((ADC_CGR_GAIN4_Msk & ((value) << ADC_CGR_GAIN4_Pos)))
#define ADC_CGR_GAIN5_Pos 10
#define ADC_CGR_GAIN5_Msk (0x3u << ADC_CGR_GAIN5_Pos) /**< \brief (ADC_CGR) Gain for channel 5 */
#define ADC_CGR_GAIN5(value) ((ADC_CGR_GAIN5_Msk & ((value) << ADC_CGR_GAIN5_Pos)))
#define ADC_CGR_GAIN6_Pos 12
#define ADC_CGR_GAIN6_Msk (0x3u << ADC_CGR_GAIN6_Pos) /**< \brief (ADC_CGR) Gain for channel 6 */
#define ADC_CGR_GAIN6(value) ((ADC_CGR_GAIN6_Msk & ((value) << ADC_CGR_GAIN6_Pos)))
#define ADC_CGR_GAIN7_Pos 14
#define ADC_CGR_GAIN7_Msk (0x3u << ADC_CGR_GAIN7_Pos) /**< \brief (ADC_CGR) Gain for channel 7 */
#define ADC_CGR_GAIN7(value) ((ADC_CGR_GAIN7_Msk & ((value) << ADC_CGR_GAIN7_Pos)))
#define ADC_CGR_GAIN8_Pos 16
#define ADC_CGR_GAIN8_Msk (0x3u << ADC_CGR_GAIN8_Pos) /**< \brief (ADC_CGR) Gain for channel 8 */
#define ADC_CGR_GAIN8(value) ((ADC_CGR_GAIN8_Msk & ((value) << ADC_CGR_GAIN8_Pos)))
#define ADC_CGR_GAIN9_Pos 18
#define ADC_CGR_GAIN9_Msk (0x3u << ADC_CGR_GAIN9_Pos) /**< \brief (ADC_CGR) Gain for channel 9 */
#define ADC_CGR_GAIN9(value) ((ADC_CGR_GAIN9_Msk & ((value) << ADC_CGR_GAIN9_Pos)))
#define ADC_CGR_GAIN10_Pos 20
#define ADC_CGR_GAIN10_Msk (0x3u << ADC_CGR_GAIN10_Pos) /**< \brief (ADC_CGR) Gain for channel 10 */
#define ADC_CGR_GAIN10(value) ((ADC_CGR_GAIN10_Msk & ((value) << ADC_CGR_GAIN10_Pos)))
#define ADC_CGR_GAIN11_Pos 22
#define ADC_CGR_GAIN11_Msk (0x3u << ADC_CGR_GAIN11_Pos) /**< \brief (ADC_CGR) Gain for channel 11 */
#define ADC_CGR_GAIN11(value) ((ADC_CGR_GAIN11_Msk & ((value) << ADC_CGR_GAIN11_Pos)))
#define ADC_CGR_GAIN12_Pos 24
#define ADC_CGR_GAIN12_Msk (0x3u << ADC_CGR_GAIN12_Pos) /**< \brief (ADC_CGR) Gain for channel 12 */
#define ADC_CGR_GAIN12(value) ((ADC_CGR_GAIN12_Msk & ((value) << ADC_CGR_GAIN12_Pos)))
#define ADC_CGR_GAIN13_Pos 26
#define ADC_CGR_GAIN13_Msk (0x3u << ADC_CGR_GAIN13_Pos) /**< \brief (ADC_CGR) Gain for channel 13 */
#define ADC_CGR_GAIN13(value) ((ADC_CGR_GAIN13_Msk & ((value) << ADC_CGR_GAIN13_Pos)))
#define ADC_CGR_GAIN14_Pos 28
#define ADC_CGR_GAIN14_Msk (0x3u << ADC_CGR_GAIN14_Pos) /**< \brief (ADC_CGR) Gain for channel 14 */
#define ADC_CGR_GAIN14(value) ((ADC_CGR_GAIN14_Msk & ((value) << ADC_CGR_GAIN14_Pos)))
#define ADC_CGR_GAIN15_Pos 30
#define ADC_CGR_GAIN15_Msk (0x3u << ADC_CGR_GAIN15_Pos) /**< \brief (ADC_CGR) Gain for channel 15 */
#define ADC_CGR_GAIN15(value) ((ADC_CGR_GAIN15_Msk & ((value) << ADC_CGR_GAIN15_Pos)))
/* -------- ADC_CDOR : (AFEC Offset: 0x5C) Channel DC Offset Register -------- */
#define ADC_CDOR_OFF0 (0x1u << 0) /**< \brief (ADC_CDOR) Offset for channel 0 */
#define ADC_CDOR_OFF1 (0x1u << 1) /**< \brief (ADC_CDOR) Offset for channel 1 */
#define ADC_CDOR_OFF2 (0x1u << 2) /**< \brief (ADC_CDOR) Offset for channel 2 */
#define ADC_CDOR_OFF3 (0x1u << 3) /**< \brief (ADC_CDOR) Offset for channel 3 */
#define ADC_CDOR_OFF4 (0x1u << 4) /**< \brief (ADC_CDOR) Offset for channel 4 */
#define ADC_CDOR_OFF5 (0x1u << 5) /**< \brief (ADC_CDOR) Offset for channel 5 */
#define ADC_CDOR_OFF6 (0x1u << 6) /**< \brief (ADC_CDOR) Offset for channel 6 */
#define ADC_CDOR_OFF7 (0x1u << 7) /**< \brief (ADC_CDOR) Offset for channel 7 */
#define ADC_CDOR_OFF8 (0x1u << 8) /**< \brief (ADC_CDOR) Offset for channel 8 */
#define ADC_CDOR_OFF9 (0x1u << 9) /**< \brief (ADC_CDOR) Offset for channel 9 */
#define ADC_CDOR_OFF10 (0x1u << 10) /**< \brief (ADC_CDOR) Offset for channel 10 */
#define ADC_CDOR_OFF11 (0x1u << 11) /**< \brief (ADC_CDOR) Offset for channel 11 */
#define ADC_CDOR_OFF12 (0x1u << 12) /**< \brief (ADC_CDOR) Offset for channel 12 */
#define ADC_CDOR_OFF13 (0x1u << 13) /**< \brief (ADC_CDOR) Offset for channel 13 */
#define ADC_CDOR_OFF14 (0x1u << 14) /**< \brief (ADC_CDOR) Offset for channel 14 */
#define ADC_CDOR_OFF15 (0x1u << 15) /**< \brief (ADC_CDOR) Offset for channel 15 */
#define ADC_CDOR_OVRE16 (0x1u << 16) /**< \brief (ADC_CDOR)  */
#define ADC_CDOR_OVRE17 (0x1u << 17) /**< \brief (ADC_CDOR)  */
#define ADC_CDOR_OFF18 (0x1u << 18) /**< \brief (ADC_CDOR) Offset for channel 18 */
#define ADC_CDOR_OFF19 (0x1u << 19) /**< \brief (ADC_CDOR) Offset for channel 19 */
#define ADC_CDOR_OFF20 (0x1u << 20) /**< \brief (ADC_CDOR) Offset for channel 20 */
#define ADC_CDOR_OFF21 (0x1u << 21) /**< \brief (ADC_CDOR) Offset for channel 21 */
#define ADC_CDOR_OFF22 (0x1u << 22) /**< \brief (ADC_CDOR) Offset for channel 22 */
#define ADC_CDOR_OFF23 (0x1u << 23) /**< \brief (ADC_CDOR) Offset for channel 23 */
/* -------- ADC_DIFFR : (AFEC Offset: 0x60) Channel Differential Register -------- */
#define ADC_DIFFR_DIFF0 (0x1u << 0) /**< \brief (ADC_DIFFR) Differential inputs for channel 0 */
#define ADC_DIFFR_DIFF1 (0x1u << 1) /**< \brief (ADC_DIFFR) Differential inputs for channel 1 */
#define ADC_DIFFR_DIFF2 (0x1u << 2) /**< \brief (ADC_DIFFR) Differential inputs for channel 2 */
#define ADC_DIFFR_DIFF3 (0x1u << 3) /**< \brief (ADC_DIFFR) Differential inputs for channel 3 */
#define ADC_DIFFR_DIFF4 (0x1u << 4) /**< \brief (ADC_DIFFR) Differential inputs for channel 4 */
#define ADC_DIFFR_DIFF5 (0x1u << 5) /**< \brief (ADC_DIFFR) Differential inputs for channel 5 */
#define ADC_DIFFR_DIFF6 (0x1u << 6) /**< \brief (ADC_DIFFR) Differential inputs for channel 6 */
#define ADC_DIFFR_DIFF7 (0x1u << 7) /**< \brief (ADC_DIFFR) Differential inputs for channel 7 */
#define ADC_DIFFR_DIFF8 (0x1u << 8) /**< \brief (ADC_DIFFR) Differential inputs for channel 8 */
#define ADC_DIFFR_DIFF9 (0x1u << 9) /**< \brief (ADC_DIFFR) Differential inputs for channel 9 */
#define ADC_DIFFR_DIFF10 (0x1u << 10) /**< \brief (ADC_DIFFR) Differential inputs for channel 10 */
#define ADC_DIFFR_DIFF11 (0x1u << 11) /**< \brief (ADC_DIFFR) Differential inputs for channel 11 */
#define ADC_DIFFR_DIFF12 (0x1u << 12) /**< \brief (ADC_DIFFR) Differential inputs for channel 12 */
#define ADC_DIFFR_DIFF13 (0x1u << 13) /**< \brief (ADC_DIFFR) Differential inputs for channel 13 */
#define ADC_DIFFR_DIFF14 (0x1u << 14) /**< \brief (ADC_DIFFR) Differential inputs for channel 14 */
#define ADC_DIFFR_DIFF15 (0x1u << 15) /**< \brief (ADC_DIFFR) Differential inputs for channel 15 */
#define ADC_DIFFR_DIFF16 (0x1u << 16) /**< \brief (ADC_DIFFR) Differential inputs for channel 16 */
#define ADC_DIFFR_DIFF17 (0x1u << 17) /**< \brief (ADC_DIFFR) Differential inputs for channel 17 */
#define ADC_DIFFR_DIFF18 (0x1u << 18) /**< \brief (ADC_DIFFR) Differential inputs for channel 18 */
#define ADC_DIFFR_DIFF19 (0x1u << 19) /**< \brief (ADC_DIFFR) Differential inputs for channel 19 */
#define ADC_DIFFR_DIFF20 (0x1u << 20) /**< \brief (ADC_DIFFR) Differential inputs for channel 20 */
#define ADC_DIFFR_DIFF21 (0x1u << 21) /**< \brief (ADC_DIFFR) Differential inputs for channel 21 */
#define ADC_DIFFR_DIFF22 (0x1u << 22) /**< \brief (ADC_DIFFR) Differential inputs for channel 22 */
#define ADC_DIFFR_DIFF23 (0x1u << 23) /**< \brief (ADC_DIFFR) Differential inputs for channel 23 */
/* -------- ADC_CSELR : (AFEC Offset: 0x64) Channel Register Selection -------- */
#define ADC_CSELR_CSEL_Pos 0
#define ADC_CSELR_CSEL_Msk (0xfu << ADC_CSELR_CSEL_Pos) /**< \brief (ADC_CSELR) Channel Selection */
/* -------- ADC_CDR : (AFEC Offset: 0x68) Channel Data Register -------- */
#define ADC_CDR_DATA_Pos 0
#define ADC_CDR_DATA_Msk (0xfffu << ADC_CDR_DATA_Pos) /**< \brief (ADC_CDR) Converted Data */
/* -------- ADC_COCR : (AFEC Offset: 0x6C) Channel Offset Compensation Register -------- */
#define ADC_COCR_AOFF_Pos 0
#define ADC_COCR_AOFF_Msk (0xfffu << ADC_COCR_AOFF_Pos) /**< \brief (ADC_COCR) Analog Offset */
/* -------- ADC_TEMPMR : (AFEC Offset: 0x70) Temperature Sensor Mode Register -------- */
#define ADC_TEMPMR_RTCT (0x1u << 0) /**< \brief (ADC_TEMPMR) Temperature Sensor RTC Trigger mode */
#define ADC_TEMPMR_TEMPCMPMOD_Pos 4
#define ADC_TEMPMR_TEMPCMPMOD_Msk (0x3u << ADC_TEMPMR_TEMPCMPMOD_Pos) /**< \brief (ADC_TEMPMR) Temperature Comparison Mode */
#define   ADC_TEMPMR_TEMPCMPMOD_LOW (0x0u << 4) /**< \brief (ADC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window. */
#define   ADC_TEMPMR_TEMPCMPMOD_HIGH (0x1u << 4) /**< \brief (ADC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window. */
